In [1]:
import numpy as np
import numpy.random as random
import scipy as sp
import pandas as pd

import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns
%matplotlib inline

%precision 3

'%.3f'

In [2]:
# p.165-166
hier_df = pd.DataFrame(np.arange(9).reshape(3, 3),
                       index = [
                                ['a','a', 'b'],
                                [1  , 2 , 2 ]
                                ],
                       columns = [
                                  ['Pusan', 'Seoul', 'Pusan'],
                                  ['Blue', 'Red', 'Red']
                                  ]
                       )

hier_df

    Pusan Seoul Pusan
     Blue   Red   Red
a 1     0     1     2
  2     3     4     5
b 2     6     7     8

In [3]:
# p.166

hier_df.index.names = ['key1', 'key2']
hier_df.columns.names = ['city', 'color']

hier_df

city      Pusan Seoul Pusan
color      Blue   Red   Red
key1 key2
a    1        0     1     2
     2        3     4     5
b    2        6     7     8

In [4]:
# p.166

hier_df['Pusan']

color      Blue  Red
key1 key2
a    1        0    2
     2        3    5
b    2        6    8

In [5]:
# p.167

hier_df.sum(level = 'key2', axis = 0)

city  Pusan Seoul Pusan
color  Blue   Red   Red
key2
1         0     1     2
2         9    11    13

In [6]:
# p.167

hier_df.sum(level = 'color', axis = 1)

color      Blue  Red
key1 key2
a    1        0    3
     2        3    9
b    2        6   15

In [7]:
# p.167

hier_df.drop(['b'])

city      Pusan Seoul Pusan
color      Blue   Red   Red
key1 key2
a    1        0     1     2
     2        3     4     5

In [8]:
# p.167-168 Practice INPUT


hier_df1 = pd.DataFrame(
    np.arange(12).reshape((3, 4)),
    index = [['c', 'd', 'd'],[1,2,1]],
    columns = [['Daegu', 'Dajeon', 'Gangneung', 'Daegu'],
              ['Yellow', 'Yellow', 'Red', 'Blue']]
)

hier_df1.index.names = ['key1', 'key2']
hier_df1.columns.names = ['city', 'color']

hier_df1

city       Daegu Dajeon Gangneung Daegu
color     Yellow Yellow       Red  Blue
key1 key2
c    1         0      1         2     3
d    2         4      5         6     7
     1         8      9        10    11

In [9]:
# p.167-168 Practice 6-1

hier_df1['Daegu']

color      Yellow  Blue
key1 key2
c    1          0     3
d    2          4     7
     1          8    11

In [10]:
# p.167-168 Practice 6-2

hier_df1.mean(level = 'city', axis = 1)

city       Daegu  Dajeon  Gangneung
key1 key2
c    1       1.5     1.0        2.0
d    2       5.5     5.0        6.0
     1       9.5     9.0       10.0

In [11]:
# p.167-168 Practice 6-3

hier_df1.sum(level = 'key2', axis = 0)

city   Daegu Dajeon Gangneung Daegu
color Yellow Yellow       Red  Blue
key2
1          8     10        12    14
2          4      5         6     7

In [23]:
# p.168

data1 = {
    'id'         : ['100',      '101',      '102',      '103',      '104',      '106',      '108',      '110',      '111',      '113'],
    'city'       : ['Seoul',    'Pusan',    'Daegu',    'Gangneung','Seoul',    'Seoul',    'Pusan',    'Daegu',    'Gangneung','Seoul'],
    'birth_year' : [1990,       1989,       1992,       1997,       1982,       1991,       1988,       1990,       1995,       1981],
    'name'       : ['JH',       'HJ',       'MJ',       'MH',       'ST',       'MN',       'SU',       'MS',       'JH',       'DH']
    }
df1 = pd.DataFrame(data1)

df1

    id       city  birth_year name
0  100      Seoul        1990   JH
1  101      Pusan        1989   HJ
2  102      Daegu        1992   MJ
3  103  Gangneung        1997   MH
4  104      Seoul        1982   ST
5  106      Seoul        1991   MN
6  108      Pusan        1988   SU
7  110      Daegu        1990   MS
8  111  Gangneung        1995   JH
9  113      Seoul        1981   DH

In [24]:
# p.169

data2 = {
    'id'       : ['100',        '101',      '102',      '105',      '107'],
    'math'     : [50,           43,         33,         76,         98],
    'english'  : [90,           30,         20,         50,         30],
    'sex'      : ['M',          'F',        'F',        'M',        'M'],
    'index_num': [0,            1,          2,          3,          4]
         }

df2= pd.DataFrame(data2)

df2

    id  math  english sex  index_num
0  100    50       90   M          0
1  101    43       30   F          1
2  102    33       20   F          2
3  105    76       50   M          3
4  107    98       30   M          4

In [25]:
# p.170

print("inner join")
pd.merge(df1, df2, on='id')

inner join

    id   city  birth_year name  math  english sex  index_num
0  100  Seoul        1990   JH    50       90   M          0
1  101  Pusan        1989   HJ    43       30   F          1
2  102  Daegu        1992   MJ    33       20   F          2

In [26]:
df1.merge(df2, on = 'id') # 얘도 디폴트 inner join인가?

    id   city  birth_year name  math  english sex  index_num
0  100  Seoul        1990   JH    50       90   M          0
1  101  Pusan        1989   HJ    43       30   F          1
2  102  Daegu        1992   MJ    33       20   F          2

In [27]:
# p.171

print("outer join")
pd.merge(df1, df2, how = 'outer')

outer join

     id       city  birth_year name  math  english  sex  index_num
0   100      Seoul      1990.0   JH  50.0     90.0    M        0.0
1   101      Pusan      1989.0   HJ  43.0     30.0    F        1.0
2   102      Daegu      1992.0   MJ  33.0     20.0    F        2.0
3   103  Gangneung      1997.0   MH   NaN      NaN  NaN        NaN
4   104      Seoul      1982.0   ST   NaN      NaN  NaN        NaN
5   106      Seoul      1991.0   MN   NaN      NaN  NaN        NaN
6   108      Pusan      1988.0   SU   NaN      NaN  NaN        NaN
7   110      Daegu      1990.0   MS   NaN      NaN  NaN        NaN
8   111  Gangneung      1995.0   JH   NaN      NaN  NaN        NaN
9   113      Seoul      1981.0   DH   NaN      NaN  NaN        NaN
10  105        NaN         NaN  NaN  76.0     50.0    M        3.0
11  107        NaN         NaN  NaN  98.0     30.0    M        4.0

In [28]:
df1.merge(df2, how = 'outer') # 이렇게 해도 how 잘 지정하면 outer join

     id       city  birth_year name  math  english  sex  index_num
0   100      Seoul      1990.0   JH  50.0     90.0    M        0.0
1   101      Pusan      1989.0   HJ  43.0     30.0    F        1.0
2   102      Daegu      1992.0   MJ  33.0     20.0    F        2.0
3   103  Gangneung      1997.0   MH   NaN      NaN  NaN        NaN
4   104      Seoul      1982.0   ST   NaN      NaN  NaN        NaN
5   106      Seoul      1991.0   MN   NaN      NaN  NaN        NaN
6   108      Pusan      1988.0   SU   NaN      NaN  NaN        NaN
7   110      Daegu      1990.0   MS   NaN      NaN  NaN        NaN
8   111  Gangneung      1995.0   JH   NaN      NaN  NaN        NaN
9   113      Seoul      1981.0   DH   NaN      NaN  NaN        NaN
10  105        NaN         NaN  NaN  76.0     50.0    M        3.0
11  107        NaN         NaN  NaN  98.0     30.0    M        4.0

In [29]:
# p.171

print("index 이용")
pd.merge(df1, df2, left_index=True, right_on='index_num')

index 이용

  id_x       city  birth_year name id_y  math  english sex  index_num
0  100      Seoul        1990   JH  100    50       90   M          0
1  101      Pusan        1989   HJ  101    43       30   F          1
2  102      Daegu        1992   MJ  102    33       20   F          2
3  103  Gangneung        1997   MH  105    76       50   M          3
4  104      Seoul        1982   ST  107    98       30   M          4

In [20]:
pd.merge(df1, df2, left_index=True, right_index=True) # 시도

  id_x       city  birth_year name id_y  math  english sex  index_num
0  100      Seoul        1990   JH  100    50       90   M          0
1  101      Pusan        1989   HJ  101    43       30   F          1
2  102      Daegu        1992   MJ  102    33       20   F          2
3  103  Gangneung        1997   MH  105    76       50   M          3
4  104      Seoul        1982   ST  107    98       30   M          4

In [21]:
pd.merge(df1, df2, left_on='id', right_index=True) # 시도

ValueError: ignored

* left_on : label or list, or array-like
    * Column or index level names to join on in the left DataFrame. Can also be an array or list of arrays of the length of the left DataFrame. These arrays are treated as if they are columns.

* right_on : label or list, or array-like
    * Column or index level names to join on in the right DataFrame. Can also be an array or list of arrays of the length of the right DataFrame. These arrays are treated as if they are columns

* left_index : bool, default False
    * Use the index from the left DataFrame as the join key(s). If it is a MultiIndex, the number of keys in the other DataFrame (either the index or a number of columns) must match the number of levels.
* right_index : bool, default False
    * Use the index from the right DataFrame as the join key. Same caveats as left_index.

In [30]:
# p.172

print("left join")
pd.merge(df1, df2, how = 'left')

left join

    id       city  birth_year name  math  english  sex  index_num
0  100      Seoul        1990   JH  50.0     90.0    M        0.0
1  101      Pusan        1989   HJ  43.0     30.0    F        1.0
2  102      Daegu        1992   MJ  33.0     20.0    F        2.0
3  103  Gangneung        1997   MH   NaN      NaN  NaN        NaN
4  104      Seoul        1982   ST   NaN      NaN  NaN        NaN
5  106      Seoul        1991   MN   NaN      NaN  NaN        NaN
6  108      Pusan        1988   SU   NaN      NaN  NaN        NaN
7  110      Daegu        1990   MS   NaN      NaN  NaN        NaN
8  111  Gangneung        1995   JH   NaN      NaN  NaN        NaN
9  113      Seoul        1981   DH   NaN      NaN  NaN        NaN

In [32]:
df1.merge(df2, how = 'left') # 동일

    id       city  birth_year name  math  english  sex  index_num
0  100      Seoul        1990   JH  50.0     90.0    M        0.0
1  101      Pusan        1989   HJ  43.0     30.0    F        1.0
2  102      Daegu        1992   MJ  33.0     20.0    F        2.0
3  103  Gangneung        1997   MH   NaN      NaN  NaN        NaN
4  104      Seoul        1982   ST   NaN      NaN  NaN        NaN
5  106      Seoul        1991   MN   NaN      NaN  NaN        NaN
6  108      Pusan        1988   SU   NaN      NaN  NaN        NaN
7  110      Daegu        1990   MS   NaN      NaN  NaN        NaN
8  111  Gangneung        1995   JH   NaN      NaN  NaN        NaN
9  113      Seoul        1981   DH   NaN      NaN  NaN        NaN

In [33]:
# p.172

data3 = {
    'id'         : ['117',      '118',      '119',      '120',      '125'],
    'city'       : ['Ilsan',    'Gunpo',    'Seoul',    'Changwon', 'Jeju'],
    'birth_year' : [1990,       1989,       1992,       1997,       1982],
    'name'       : ['JH',       'YH',       'JH',       'YH',       'HJ']
    }
df3 = pd.DataFrame(data3)

df3

    id      city  birth_year name
0  117     Ilsan        1990   JH
1  118     Gunpo        1989   YH
2  119     Seoul        1992   JH
3  120  Changwon        1997   YH
4  125      Jeju        1982   HJ

In [34]:
# p.172

print("concat 수직방향 결합")
concat_data = pd.concat([df1, df3])
concat_data

concat 수직방향 결합

    id       city  birth_year name
0  100      Seoul        1990   JH
1  101      Pusan        1989   HJ
2  102      Daegu        1992   MJ
3  103  Gangneung        1997   MH
4  104      Seoul        1982   ST
5  106      Seoul        1991   MN
6  108      Pusan        1988   SU
7  110      Daegu        1990   MS
8  111  Gangneung        1995   JH
9  113      Seoul        1981   DH
0  117      Ilsan        1990   JH
1  118      Gunpo        1989   YH
2  119      Seoul        1992   JH
3  120   Changwon        1997   YH
4  125       Jeju        1982   HJ

In [36]:
df1.concat(df3) # 시도. 안됨.

AttributeError: ignored